/************************************************************
 * @file: video05.cpp
 * @version: 1.0.0
 *
 * @brief: 16 - 05 ｜ 畫數字統計長條圖的練習 (使用陣列)
 *       [1]
 *       [2]
 *       [3]
 *
 * @author: BecomeBamboo
 * @lastEditTime: 2025/7/22 10:37
 ************************************************************/

#include <stdio.h>

/**
 *
 *   Enter 10 number of: 11 12 17 31 34 37 39 40 91 98
     10:
     20: ***
     30:
     40: *****
     50:
     60:
     70:
     80:
     90:
    100: **
 *
 *
 * @return
 */
int main() {
  // 数组长度为10
  int i, j, n, b[10] = {0};
  printf("Enter 10 number of: ");
  for (i = 1; i <= 10; i++) {
    scanf("%d", &n);
    // 比如输入31，那么就是31-40区间，也就是b[2]加1，因为从b[0]开始，到b[9]
    // 31-40 ==> 40-39 ==> 3
    b[(n - 1) / 10]++;
  }

  for (i = 1; i <= 10; i++) {
    // 10-90前空1格，%3d表示占3格，100正好3格
    printf("%3d: ", i * 10);
    // i为3的时候，也就是b[2]
    for (j = 1; j <= b[i - 1]; j++) {
      printf("*");
    }
    printf("\n");
  }

  return 0;
}
